ARMmbed/DAPLink/shared/cmsis/TARGET_Freescale/include/device/MK70F12/MK70F12.h
/* DAC - Register array accessors */
#define DAC0_DATL(index)                         DAC_DATL_REG(DAC0,index)
#define DAC1_DATL(index)                         DAC_DATL_REG(DAC1,index)
#define DAC0_DATH(index)                         DAC_DATH_REG(DAC0,index)
#define DAC1_DATH(index)                         DAC_DATH_REG(DAC1,index)

/*!
 * @}
 */ /* end of group DAC_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group DAC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DDR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DDR_Peripheral_Access_Layer DDR Peripheral Access Layer
 * @{
 */

/** DDR - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR00;                              /**< DDR Control Register 0, offset: 0x0 */
  __I  uint32_t CR01;                              /**< DDR Control Register 1, offset: 0x4 */
  __IO uint32_t CR02;                              /**< DDR Control Register 2, offset: 0x8 */
  __IO uint32_t CR03;                              /**< DDR Control Register 3, offset: 0xC */
  __IO uint32_t CR04;                              /**< DDR Control Register 4, offset: 0x10 */
  __IO uint32_t CR05;                              /**< DDR Control Register 5, offset: 0x14 */
  __IO uint32_t CR06;                              /**< DDR Control Register 6, offset: 0x18 */
  __IO uint32_t CR07;                              /**< DDR Control Register 7, offset: 0x1C */
  __IO uint32_t CR08;                              /**< DDR Control Register 8, offset: 0x20 */
  __IO uint32_t CR09;                              /**< DDR Control Register 9, offset: 0x24 */
  __IO uint32_t CR10;                              /**< DDR Control Register 10, offset: 0x28 */
  __IO uint32_t CR11;                              /**< DDR Control Register 11, offset: 0x2C */
  __IO uint32_t CR12;                              /**< DDR Control Register 12, offset: 0x30 */
  __IO uint32_t CR13;                              /**< DDR Control Register 13, offset: 0x34 */
  __IO uint32_t CR14;                              /**< DDR Control Register 14, offset: 0x38 */
  __IO uint32_t CR15;                              /**< DDR Control Register 15, offset: 0x3C */
  __IO uint32_t CR16;                              /**< DDR Control Register 16, offset: 0x40 */
  __IO uint32_t CR17;                              /**< DDR Control Register 17, offset: 0x44 */
  __IO uint32_t CR18;                              /**< DDR Control Register 18, offset: 0x48 */
  __IO uint32_t CR19;                              /**< DDR Control Register 19, offset: 0x4C */
  __IO uint32_t CR20;                              /**< DDR Control Register 20, offset: 0x50 */
  __IO uint32_t CR21;                              /**< DDR Control Register 21, offset: 0x54 */
  __IO uint32_t CR22;                              /**< DDR Control Register 22, offset: 0x58 */
  __I  uint32_t CR23;                              /**< DDR Control Register 23, offset: 0x5C */
  __I  uint32_t CR24;                              /**< DDR Control Register 24, offset: 0x60 */
  __IO uint32_t CR25;                              /**< DDR Control Register 25, offset: 0x64 */
  __IO uint32_t CR26;                              /**< DDR Control Register 26, offset: 0x68 */
  __IO uint32_t CR27;                              /**< DDR Control Register 27, offset: 0x6C */
  __IO uint32_t CR28;                              /**< DDR Control Register 28, offset: 0x70 */
  __IO uint32_t CR29;                              /**< DDR Control Register 29, offset: 0x74 */
  __IO uint32_t CR30;                              /**< DDR Control Register 30, offset: 0x78 */
  __IO uint32_t CR31;                              /**< DDR Control Register 31, offset: 0x7C */
  __I  uint32_t CR32;                              /**< DDR Control Register 32, offset: 0x80 */
  __I  uint32_t CR33;                              /**< DDR Control Register 33, offset: 0x84 */
  __IO uint32_t CR34;                              /**< DDR Control Register 34, offset: 0x88 */
  __I  uint32_t CR35;                              /**< DDR Control Register 35, offset: 0x8C */
  __I  uint32_t CR36;                              /**< DDR Control Register 36, offset: 0x90 */
  __IO uint32_t CR37;                              /**< DDR Control Register 37, offset: 0x94 */
  __IO uint32_t CR38;                              /**< DDR Control Register 38, offset: 0x98 */
  __IO uint32_t CR39;                              /**< DDR Control Register 39, offset: 0x9C */
  __IO uint32_t CR40;                              /**< DDR Control Register 40, offset: 0xA0 */
  __IO uint32_t CR41;                              /**< DDR Control Register 41, offset: 0xA4 */
  __IO uint32_t CR42;                              /**< DDR Control Register 42, offset: 0xA8 */
  __IO uint32_t CR43;                              /**< DDR Control Register 43, offset: 0xAC */
  __IO uint32_t CR44;                              /**< DDR Control Register 44, offset: 0xB0 */
  __IO uint32_t CR45;                              /**< DDR Control Register 45, offset: 0xB4 */
  __IO uint32_t CR46;                              /**< DDR Control Register 46, offset: 0xB8 */
  __IO uint32_t CR47;                              /**< DDR Control Register 47, offset: 0xBC */
  __IO uint32_t CR48;                              /**< DDR Control Register 48, offset: 0xC0 */
  __IO uint32_t CR49;                              /**< DDR Control Register 49, offset: 0xC4 */
  __IO uint32_t CR50;                              /**< DDR Control Register 50, offset: 0xC8 */
  __IO uint32_t CR51;                              /**< DDR Control Register 51, offset: 0xCC */
  __IO uint32_t CR52;                              /**< DDR Control Register 52, offset: 0xD0 */
  __IO uint32_t CR53;                              /**< DDR Control Register 53, offset: 0xD4 */
  __IO uint32_t CR54;                              /**< DDR Control Register 54, offset: 0xD8 */
  __IO uint32_t CR55;                              /**< DDR Control Register 55, offset: 0xDC */
  __IO uint32_t CR56;                              /**< DDR Control Register 56, offset: 0xE0 */
  __IO uint32_t CR57;                              /**< DDR Control Register 57, offset: 0xE4 */
  __I  uint32_t CR58;                              /**< DDR Control Register 58, offset: 0xE8 */
  __I  uint32_t CR59;                              /**< DDR Control Register 59, offset: 0xEC */
  __I  uint32_t CR60;                              /**< DDR Control Register 60, offset: 0xF0 */
  __I  uint32_t CR61;                              /**< DDR Control Register 61, offset: 0xF4 */
  __I  uint32_t CR62;                              /**< DDR Control Register 62, offset: 0xF8 */
  __I  uint32_t CR63;                              /**< DDR Control Register 63, offset: 0xFC */
       uint8_t RESERVED_0[128];
  __IO uint32_t RCR;                               /**< RCR Control Register, offset: 0x180 */
       uint8_t RESERVED_1[40];
  __IO uint32_t PAD_CTRL;                          /**< I/O Pad Control Register, offset: 0x1AC */
} DDR_Type, *DDR_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- DDR - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DDR_Register_Accessor_Macros DDR - Register accessor macros
 * @{
 */


/* DDR - Register accessors */
#define DDR_CR00_REG(base)                       ((base)->CR00)
#define DDR_CR01_REG(base)                       ((base)->CR01)
#define DDR_CR02_REG(base)                       ((base)->CR02)
#define DDR_CR03_REG(base)                       ((base)->CR03)
#define DDR_CR04_REG(base)                       ((base)->CR04)
#define DDR_CR05_REG(base)                       ((base)->CR05)
#define DDR_CR06_REG(base)                       ((base)->CR06)
#define DDR_CR07_REG(base)                       ((base)->CR07)
#define DDR_CR08_REG(base)                       ((base)->CR08)
#define DDR_CR09_REG(base)                       ((base)->CR09)
#define DDR_CR10_REG(base)                       ((base)->CR10)
#define DDR_CR11_REG(base)                       ((base)->CR11)
#define DDR_CR12_REG(base)                       ((base)->CR12)
#define DDR_CR13_REG(base)                       ((base)->CR13)
#define DDR_CR14_REG(base)                       ((base)->CR14)
#define DDR_CR15_REG(base)                       ((base)->CR15)
#define DDR_CR16_REG(base)                       ((base)->CR16)
#define DDR_CR17_REG(base)                       ((base)->CR17)
#define DDR_CR18_REG(base)                       ((base)->CR18)
#define DDR_CR19_REG(base)                       ((base)->CR19)
#define DDR_CR20_REG(base)                       ((base)->CR20)
#define DDR_CR21_REG(base)                       ((base)->CR21)
#define DDR_CR22_REG(base)                       ((base)->CR22)
#define DDR_CR23_REG(base)                       ((base)->CR23)
#define DDR_CR24_REG(base)                       ((base)->CR24)
#define DDR_CR25_REG(base)                       ((base)->CR25)
#define DDR_CR26_REG(base)                       ((base)->CR26)
#define DDR_CR27_REG(base)                       ((base)->CR27)
#define DDR_CR28_REG(base)                       ((base)->CR28)
#define DDR_CR29_REG(base)                       ((base)->CR29)
#define DDR_CR30_REG(base)                       ((base)->CR30)
#define DDR_CR31_REG(base)                       ((base)->CR31)
#define DDR_CR32_REG(base)                       ((base)->CR32)
#define DDR_CR33_REG(base)                       ((base)->CR33)
#define DDR_CR34_REG(base)                       ((base)->CR34)
#define DDR_CR35_REG(base)                       ((base)->CR35)
#define DDR_CR36_REG(base)                       ((base)->CR36)
#define DDR_CR37_REG(base)                       ((base)->CR37)
#define DDR_CR38_REG(base)                       ((base)->CR38)
#define DDR_CR39_REG(base)                       ((base)->CR39)
#define DDR_CR40_REG(base)                       ((base)->CR40)
#define DDR_CR41_REG(base)                       ((base)->CR41)
#define DDR_CR42_REG(base)                       ((base)->CR42)
#define DDR_CR43_REG(base)                       ((base)->CR43)
#define DDR_CR44_REG(base)                       ((base)->CR44)
#define DDR_CR45_REG(base)                       ((base)->CR45)
#define DDR_CR46_REG(base)                       ((base)->CR46)
#define DDR_CR47_REG(base)                       ((base)->CR47)
#define DDR_CR48_REG(base)                       ((base)->CR48)
#define DDR_CR49_REG(base)                       ((base)->CR49)
#define DDR_CR50_REG(base)                       ((base)->CR50)
#define DDR_CR51_REG(base)                       ((base)->CR51)
#define DDR_CR52_REG(base)                       ((base)->CR52)
#define DDR_CR53_REG(base)                       ((base)->CR53)
#define DDR_CR54_REG(base)                       ((base)->CR54)
#define DDR_CR55_REG(base)                       ((base)->CR55)
#define DDR_CR56_REG(base)                       ((base)->CR56)
#define DDR_CR57_REG(base)                       ((base)->CR57)
#define DDR_CR58_REG(base)                       ((base)->CR58)
#define DDR_CR59_REG(base)                       ((base)->CR59)
#define DDR_CR60_REG(base)                       ((base)->CR60)
#define DDR_CR61_REG(base)                       ((base)->CR61)
#define DDR_CR62_REG(base)                       ((base)->CR62)
#define DDR_CR63_REG(base)                       ((base)->CR63)
#define DDR_RCR_REG(base)                        ((base)->RCR)
#define DDR_PAD_CTRL_REG(base)                   ((base)->PAD_CTRL)

/*!
 * @}
 */ /* end of group DDR_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- DDR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DDR_Register_Masks DDR Register Masks
 * @{
 */

