ARMmbed/DAPLink/shared/cmsis/TARGET_Freescale/include/device/MK70F12/MK70F12.h
/* CR00 Bit Fields */
#define DDR_CR00_START_MASK                      0x1u
#define DDR_CR00_START_SHIFT                     0
#define DDR_CR00_DDRCLS_MASK                     0xF00u
#define DDR_CR00_DDRCLS_SHIFT                    8
#define DDR_CR00_DDRCLS(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR00_DDRCLS_SHIFT))&DDR_CR00_DDRCLS_MASK)
#define DDR_CR00_VERSION_MASK                    0xFFFF0000u
#define DDR_CR00_VERSION_SHIFT                   16
#define DDR_CR00_VERSION(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR00_VERSION_SHIFT))&DDR_CR00_VERSION_MASK)
/* CR01 Bit Fields */
#define DDR_CR01_MAXROW_MASK                     0x1Fu
#define DDR_CR01_MAXROW_SHIFT                    0
#define DDR_CR01_MAXROW(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR01_MAXROW_SHIFT))&DDR_CR01_MAXROW_MASK)
#define DDR_CR01_MAXCOL_MASK                     0xF00u
#define DDR_CR01_MAXCOL_SHIFT                    8
#define DDR_CR01_MAXCOL(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR01_MAXCOL_SHIFT))&DDR_CR01_MAXCOL_MASK)
#define DDR_CR01_CSMAX_MASK                      0x30000u
#define DDR_CR01_CSMAX_SHIFT                     16
#define DDR_CR01_CSMAX(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR01_CSMAX_SHIFT))&DDR_CR01_CSMAX_MASK)
/* CR02 Bit Fields */
#define DDR_CR02_TINIT_MASK                      0xFFFFFFu
#define DDR_CR02_TINIT_SHIFT                     0
#define DDR_CR02_TINIT(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR02_TINIT_SHIFT))&DDR_CR02_TINIT_MASK)
#define DDR_CR02_INITAREF_MASK                   0xF000000u
#define DDR_CR02_INITAREF_SHIFT                  24
#define DDR_CR02_INITAREF(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR02_INITAREF_SHIFT))&DDR_CR02_INITAREF_MASK)
/* CR03 Bit Fields */
#define DDR_CR03_LATLIN_MASK                     0xFu
#define DDR_CR03_LATLIN_SHIFT                    0
#define DDR_CR03_LATLIN(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR03_LATLIN_SHIFT))&DDR_CR03_LATLIN_MASK)
#define DDR_CR03_LATGATE_MASK                    0xF00u
#define DDR_CR03_LATGATE_SHIFT                   8
#define DDR_CR03_LATGATE(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR03_LATGATE_SHIFT))&DDR_CR03_LATGATE_MASK)
#define DDR_CR03_WRLAT_MASK                      0xF0000u
#define DDR_CR03_WRLAT_SHIFT                     16
#define DDR_CR03_WRLAT(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR03_WRLAT_SHIFT))&DDR_CR03_WRLAT_MASK)
#define DDR_CR03_TCCD_MASK                       0x1F000000u
#define DDR_CR03_TCCD_SHIFT                      24
#define DDR_CR03_TCCD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR03_TCCD_SHIFT))&DDR_CR03_TCCD_MASK)
/* CR04 Bit Fields */
#define DDR_CR04_TBINT_MASK                      0x7u
#define DDR_CR04_TBINT_SHIFT                     0
#define DDR_CR04_TBINT(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR04_TBINT_SHIFT))&DDR_CR04_TBINT_MASK)
#define DDR_CR04_TRRD_MASK                       0x700u
#define DDR_CR04_TRRD_SHIFT                      8
#define DDR_CR04_TRRD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR04_TRRD_SHIFT))&DDR_CR04_TRRD_MASK)
#define DDR_CR04_TRC_MASK                        0x3F0000u
#define DDR_CR04_TRC_SHIFT                       16
#define DDR_CR04_TRC(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR04_TRC_SHIFT))&DDR_CR04_TRC_MASK)
#define DDR_CR04_TRASMIN_MASK                    0xFF000000u
#define DDR_CR04_TRASMIN_SHIFT                   24
#define DDR_CR04_TRASMIN(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR04_TRASMIN_SHIFT))&DDR_CR04_TRASMIN_MASK)
/* CR05 Bit Fields */
#define DDR_CR05_TWTR_MASK                       0xFu
#define DDR_CR05_TWTR_SHIFT                      0
#define DDR_CR05_TWTR(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR05_TWTR_SHIFT))&DDR_CR05_TWTR_MASK)
#define DDR_CR05_TRP_MASK                        0xF00u
#define DDR_CR05_TRP_SHIFT                       8
#define DDR_CR05_TRP(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR05_TRP_SHIFT))&DDR_CR05_TRP_MASK)
#define DDR_CR05_TRTP_MASK                       0x70000u
#define DDR_CR05_TRTP_SHIFT                      16
#define DDR_CR05_TRTP(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR05_TRTP_SHIFT))&DDR_CR05_TRTP_MASK)
#define DDR_CR05_TMRD_MASK                       0x1F000000u
#define DDR_CR05_TMRD_SHIFT                      24
#define DDR_CR05_TMRD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR05_TMRD_SHIFT))&DDR_CR05_TMRD_MASK)
/* CR06 Bit Fields */
#define DDR_CR06_TMOD_MASK                       0xFFu
#define DDR_CR06_TMOD_SHIFT                      0
#define DDR_CR06_TMOD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR06_TMOD_SHIFT))&DDR_CR06_TMOD_MASK)
#define DDR_CR06_TRASMAX_MASK                    0xFFFF00u
#define DDR_CR06_TRASMAX_SHIFT                   8
#define DDR_CR06_TRASMAX(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR06_TRASMAX_SHIFT))&DDR_CR06_TRASMAX_MASK)
#define DDR_CR06_INTWBR_MASK                     0x1000000u
#define DDR_CR06_INTWBR_SHIFT                    24
/* CR07 Bit Fields */
#define DDR_CR07_CLKPW_MASK                      0x7u
#define DDR_CR07_CLKPW_SHIFT                     0
#define DDR_CR07_CLKPW(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR07_CLKPW_SHIFT))&DDR_CR07_CLKPW_MASK)
#define DDR_CR07_TCKESR_MASK                     0x1F00u
#define DDR_CR07_TCKESR_SHIFT                    8
#define DDR_CR07_TCKESR(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR07_TCKESR_SHIFT))&DDR_CR07_TCKESR_MASK)
#define DDR_CR07_AP_MASK                         0x10000u
#define DDR_CR07_AP_SHIFT                        16
#define DDR_CR07_CCAPEN_MASK                     0x1000000u
#define DDR_CR07_CCAPEN_SHIFT                    24
/* CR08 Bit Fields */
#define DDR_CR08_TRAS_MASK                       0x1u
#define DDR_CR08_TRAS_SHIFT                      0
#define DDR_CR08_TRASDI_MASK                     0xFF00u
#define DDR_CR08_TRASDI_SHIFT                    8
#define DDR_CR08_TRASDI(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR08_TRASDI_SHIFT))&DDR_CR08_TRASDI_MASK)
#define DDR_CR08_TWR_MASK                        0x1F0000u
#define DDR_CR08_TWR_SHIFT                       16
#define DDR_CR08_TWR(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR08_TWR_SHIFT))&DDR_CR08_TWR_MASK)
#define DDR_CR08_TDAL_MASK                       0x1F000000u
#define DDR_CR08_TDAL_SHIFT                      24
#define DDR_CR08_TDAL(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR08_TDAL_SHIFT))&DDR_CR08_TDAL_MASK)
/* CR09 Bit Fields */
#define DDR_CR09_TDLL_MASK                       0xFFFFu
#define DDR_CR09_TDLL_SHIFT                      0
#define DDR_CR09_TDLL(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR09_TDLL_SHIFT))&DDR_CR09_TDLL_MASK)
#define DDR_CR09_NOCMD_MASK                      0x10000u
#define DDR_CR09_NOCMD_SHIFT                     16
#define DDR_CR09_BSTLEN_MASK                     0x7000000u
#define DDR_CR09_BSTLEN_SHIFT                    24
#define DDR_CR09_BSTLEN(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR09_BSTLEN_SHIFT))&DDR_CR09_BSTLEN_MASK)
/* CR10 Bit Fields */
#define DDR_CR10_TFAW_MASK                       0x3Fu
#define DDR_CR10_TFAW_SHIFT                      0
#define DDR_CR10_TFAW(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR10_TFAW_SHIFT))&DDR_CR10_TFAW_MASK)
#define DDR_CR10_TCPD_MASK                       0xFFFF00u
#define DDR_CR10_TCPD_SHIFT                      8
#define DDR_CR10_TCPD(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR10_TCPD_SHIFT))&DDR_CR10_TCPD_MASK)
#define DDR_CR10_TRPAB_MASK                      0xF000000u
#define DDR_CR10_TRPAB_SHIFT                     24
#define DDR_CR10_TRPAB(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR10_TRPAB_SHIFT))&DDR_CR10_TRPAB_MASK)
/* CR11 Bit Fields */
#define DDR_CR11_REGDIMM_MASK                    0x1u
#define DDR_CR11_REGDIMM_SHIFT                   0
#define DDR_CR11_AREF_MASK                       0x100u
#define DDR_CR11_AREF_SHIFT                      8
#define DDR_CR11_AREFMODE_MASK                   0x10000u
#define DDR_CR11_AREFMODE_SHIFT                  16
#define DDR_CR11_TREFEN_MASK                     0x1000000u
#define DDR_CR11_TREFEN_SHIFT                    24
/* CR12 Bit Fields */
#define DDR_CR12_TRFC_MASK                       0x3FFu
#define DDR_CR12_TRFC_SHIFT                      0
#define DDR_CR12_TRFC(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR12_TRFC_SHIFT))&DDR_CR12_TRFC_MASK)
#define DDR_CR12_TREF_MASK                       0x3FFF0000u
#define DDR_CR12_TREF_SHIFT                      16
#define DDR_CR12_TREF(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR12_TREF_SHIFT))&DDR_CR12_TREF_MASK)
/* CR13 Bit Fields */
#define DDR_CR13_TREFINT_MASK                    0x3FFFu
#define DDR_CR13_TREFINT_SHIFT                   0
#define DDR_CR13_TREFINT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR13_TREFINT_SHIFT))&DDR_CR13_TREFINT_MASK)
#define DDR_CR13_PD_MASK                         0x10000u
#define DDR_CR13_PD_SHIFT                        16
/* CR14 Bit Fields */
#define DDR_CR14_TPDEX_MASK                      0xFFFFu
#define DDR_CR14_TPDEX_SHIFT                     0
#define DDR_CR14_TPDEX(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR14_TPDEX_SHIFT))&DDR_CR14_TPDEX_MASK)
#define DDR_CR14_TXSR_MASK                       0xFFFF0000u
#define DDR_CR14_TXSR_SHIFT                      16
#define DDR_CR14_TXSR(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR14_TXSR_SHIFT))&DDR_CR14_TXSR_MASK)
/* CR15 Bit Fields */
#define DDR_CR15_TXSNR_MASK                      0xFFFFu
#define DDR_CR15_TXSNR_SHIFT                     0
#define DDR_CR15_TXSNR(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR15_TXSNR_SHIFT))&DDR_CR15_TXSNR_MASK)
#define DDR_CR15_SREF_MASK                       0x10000u
#define DDR_CR15_SREF_SHIFT                      16
#define DDR_CR15_PUREF_MASK                      0x1000000u
#define DDR_CR15_PUREF_SHIFT                     24
/* CR16 Bit Fields */
#define DDR_CR16_QKREF_MASK                      0x1u
#define DDR_CR16_QKREF_SHIFT                     0
#define DDR_CR16_CLKDLY_MASK                     0x700u
#define DDR_CR16_CLKDLY_SHIFT                    8
#define DDR_CR16_CLKDLY(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR16_CLKDLY_SHIFT))&DDR_CR16_CLKDLY_MASK)
#define DDR_CR16_LPCTRL_MASK                     0x1F0000u
#define DDR_CR16_LPCTRL_SHIFT                    16
#define DDR_CR16_LPCTRL(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR16_LPCTRL_SHIFT))&DDR_CR16_LPCTRL_MASK)
/* CR17 Bit Fields */
#define DDR_CR17_LPPDCNT_MASK                    0xFFFFu
#define DDR_CR17_LPPDCNT_SHIFT                   0
#define DDR_CR17_LPPDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR17_LPPDCNT_SHIFT))&DDR_CR17_LPPDCNT_MASK)
#define DDR_CR17_LPRFCNT_MASK                    0xFFFF0000u
#define DDR_CR17_LPRFCNT_SHIFT                   16
#define DDR_CR17_LPRFCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR17_LPRFCNT_SHIFT))&DDR_CR17_LPRFCNT_MASK)
/* CR18 Bit Fields */
#define DDR_CR18_LPEXTCNT_MASK                   0xFFFFu
#define DDR_CR18_LPEXTCNT_SHIFT                  0
#define DDR_CR18_LPEXTCNT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR18_LPEXTCNT_SHIFT))&DDR_CR18_LPEXTCNT_MASK)
#define DDR_CR18_LPAUTO_MASK                     0x1F0000u
#define DDR_CR18_LPAUTO_SHIFT                    16
#define DDR_CR18_LPAUTO(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR18_LPAUTO_SHIFT))&DDR_CR18_LPAUTO_MASK)
/* CR19 Bit Fields */
#define DDR_CR19_LPINTCNT_MASK                   0xFFFFu
#define DDR_CR19_LPINTCNT_SHIFT                  0
#define DDR_CR19_LPINTCNT(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR19_LPINTCNT_SHIFT))&DDR_CR19_LPINTCNT_MASK)
#define DDR_CR19_LPRFHOLD_MASK                   0xFFFF0000u
#define DDR_CR19_LPRFHOLD_SHIFT                  16
#define DDR_CR19_LPRFHOLD(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR19_LPRFHOLD_SHIFT))&DDR_CR19_LPRFHOLD_MASK)
/* CR20 Bit Fields */
#define DDR_CR20_LPRE_MASK                       0x3u
#define DDR_CR20_LPRE_SHIFT                      0
#define DDR_CR20_LPRE(x)                         (((uint32_t)(((uint32_t)(x))<<DDR_CR20_LPRE_SHIFT))&DDR_CR20_LPRE_MASK)
#define DDR_CR20_CKSRE_MASK                      0xF00u
#define DDR_CR20_CKSRE_SHIFT                     8
#define DDR_CR20_CKSRE(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR20_CKSRE_SHIFT))&DDR_CR20_CKSRE_MASK)
#define DDR_CR20_CKSRX_MASK                      0xF0000u
#define DDR_CR20_CKSRX_SHIFT                     16
#define DDR_CR20_CKSRX(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR20_CKSRX_SHIFT))&DDR_CR20_CKSRX_MASK)
#define DDR_CR20_WRMD_MASK                       0x1000000u
#define DDR_CR20_WRMD_SHIFT                      24
/* CR21 Bit Fields */
#define DDR_CR21_MR0DAT0_MASK                    0xFFFFu
#define DDR_CR21_MR0DAT0_SHIFT                   0
#define DDR_CR21_MR0DAT0(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR21_MR0DAT0_SHIFT))&DDR_CR21_MR0DAT0_MASK)
#define DDR_CR21_MR1DAT0_MASK                    0xFFFF0000u
#define DDR_CR21_MR1DAT0_SHIFT                   16
#define DDR_CR21_MR1DAT0(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR21_MR1DAT0_SHIFT))&DDR_CR21_MR1DAT0_MASK)
/* CR22 Bit Fields */
#define DDR_CR22_MR2DATA0_MASK                   0xFFFFu
#define DDR_CR22_MR2DATA0_SHIFT                  0
#define DDR_CR22_MR2DATA0(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR22_MR2DATA0_SHIFT))&DDR_CR22_MR2DATA0_MASK)
#define DDR_CR22_MR3DAT0_MASK                    0xFFFF0000u
#define DDR_CR22_MR3DAT0_SHIFT                   16
#define DDR_CR22_MR3DAT0(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR22_MR3DAT0_SHIFT))&DDR_CR22_MR3DAT0_MASK)
/* CR23 Bit Fields */
#define DDR_CR23_Not_Used_MASK                   0xFFFFu
#define DDR_CR23_Not_Used_SHIFT                  0
#define DDR_CR23_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR23_Not_Used_SHIFT))&DDR_CR23_Not_Used_MASK)
#define DDR_CR23_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR23_NOT_USED_SHIFT                  16
#define DDR_CR23_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR23_NOT_USED_SHIFT))&DDR_CR23_NOT_USED_MASK)
/* CR25 Bit Fields */
#define DDR_CR25_BNK8_MASK                       0x1u
#define DDR_CR25_BNK8_SHIFT                      0
#define DDR_CR25_ADDPINS_MASK                    0x700u
#define DDR_CR25_ADDPINS_SHIFT                   8
#define DDR_CR25_ADDPINS(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR25_ADDPINS_SHIFT))&DDR_CR25_ADDPINS_MASK)
#define DDR_CR25_COLSIZ_MASK                     0x70000u
#define DDR_CR25_COLSIZ_SHIFT                    16
#define DDR_CR25_COLSIZ(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR25_COLSIZ_SHIFT))&DDR_CR25_COLSIZ_MASK)
#define DDR_CR25_APREBIT_MASK                    0xF000000u
#define DDR_CR25_APREBIT_SHIFT                   24
#define DDR_CR25_APREBIT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR25_APREBIT_SHIFT))&DDR_CR25_APREBIT_MASK)
/* CR26 Bit Fields */
#define DDR_CR26_AGECNT_MASK                     0xFFu
#define DDR_CR26_AGECNT_SHIFT                    0
#define DDR_CR26_AGECNT(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR26_AGECNT_SHIFT))&DDR_CR26_AGECNT_MASK)
#define DDR_CR26_CMDAGE_MASK                     0xFF00u
#define DDR_CR26_CMDAGE_SHIFT                    8
#define DDR_CR26_CMDAGE(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR26_CMDAGE_SHIFT))&DDR_CR26_CMDAGE_MASK)
#define DDR_CR26_ADDCOL_MASK                     0x10000u
#define DDR_CR26_ADDCOL_SHIFT                    16
#define DDR_CR26_BNKSPT_MASK                     0x1000000u
#define DDR_CR26_BNKSPT_SHIFT                    24
/* CR27 Bit Fields */
#define DDR_CR27_PLEN_MASK                       0x1u
#define DDR_CR27_PLEN_SHIFT                      0
#define DDR_CR27_PRIEN_MASK                      0x100u
#define DDR_CR27_PRIEN_SHIFT                     8
#define DDR_CR27_RWEN_MASK                       0x10000u
#define DDR_CR27_RWEN_SHIFT                      16
#define DDR_CR27_SWPEN_MASK                      0x1000000u
#define DDR_CR27_SWPEN_SHIFT                     24
/* CR28 Bit Fields */
#define DDR_CR28_CSMAP_MASK                      0x1u
#define DDR_CR28_CSMAP_SHIFT                     0
#define DDR_CR28_REDUC_MASK                      0x100u
#define DDR_CR28_REDUC_SHIFT                     8
#define DDR_CR28_BIGEND_MASK                     0x10000u
#define DDR_CR28_BIGEND_SHIFT                    16
#define DDR_CR28_CMDLATR_MASK                    0x1000000u
#define DDR_CR28_CMDLATR_SHIFT                   24
/* CR29 Bit Fields */
#define DDR_CR29_WRLATR_MASK                     0x1u
#define DDR_CR29_WRLATR_SHIFT                    0
#define DDR_CR29_FSTWR_MASK                      0x100u
#define DDR_CR29_FSTWR_SHIFT                     8
#define DDR_CR29_QFULL_MASK                      0x30000u
#define DDR_CR29_QFULL_SHIFT                     16
#define DDR_CR29_QFULL(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR29_QFULL_SHIFT))&DDR_CR29_QFULL_MASK)
#define DDR_CR29_RESYNC_MASK                     0x1000000u
#define DDR_CR29_RESYNC_SHIFT                    24
/* CR30 Bit Fields */
#define DDR_CR30_RSYNCRF_MASK                    0x1u
#define DDR_CR30_RSYNCRF_SHIFT                   0
#define DDR_CR30_INTSTAT_MASK                    0x1FF00u
#define DDR_CR30_INTSTAT_SHIFT                   8
#define DDR_CR30_INTSTAT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR30_INTSTAT_SHIFT))&DDR_CR30_INTSTAT_MASK)
#define DDR_CR30_INTACK_MASK                     0xFF000000u
#define DDR_CR30_INTACK_SHIFT                    24
#define DDR_CR30_INTACK(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR30_INTACK_SHIFT))&DDR_CR30_INTACK_MASK)
/* CR31 Bit Fields */
#define DDR_CR31_INTMASK_MASK                    0x1FFu
#define DDR_CR31_INTMASK_SHIFT                   0
#define DDR_CR31_INTMASK(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR31_INTMASK_SHIFT))&DDR_CR31_INTMASK_MASK)
/* CR32 Bit Fields */
#define DDR_CR32_OORAD_MASK                      0xFFFFFFFFu
#define DDR_CR32_OORAD_SHIFT                     0
#define DDR_CR32_OORAD(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR32_OORAD_SHIFT))&DDR_CR32_OORAD_MASK)
/* CR33 Bit Fields */
#define DDR_CR33_OORLEN_MASK                     0x3FFu
#define DDR_CR33_OORLEN_SHIFT                    0
#define DDR_CR33_OORLEN(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR33_OORLEN_SHIFT))&DDR_CR33_OORLEN_MASK)
#define DDR_CR33_OORTYP_MASK                     0x3F0000u
#define DDR_CR33_OORTYP_SHIFT                    16
#define DDR_CR33_OORTYP(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR33_OORTYP_SHIFT))&DDR_CR33_OORTYP_MASK)
#define DDR_CR33_OORID_MASK                      0x3000000u
#define DDR_CR33_OORID_SHIFT                     24
#define DDR_CR33_OORID(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR33_OORID_SHIFT))&DDR_CR33_OORID_MASK)
/* CR34 Bit Fields */
#define DDR_CR34_ODTRDC_MASK                     0x1u
#define DDR_CR34_ODTRDC_SHIFT                    0
#define DDR_CR34_ODTWRCS_MASK                    0x100u
#define DDR_CR34_ODTWRCS_SHIFT                   8
/* CR35 Bit Fields */
#define DDR_CR35_R2WSMCS_MASK                    0xFu
#define DDR_CR35_R2WSMCS_SHIFT                   0
#define DDR_CR35_R2WSMCS(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR35_R2WSMCS_SHIFT))&DDR_CR35_R2WSMCS_MASK)
#define DDR_CR35_W2RSMCS_MASK                    0xF00u
#define DDR_CR35_W2RSMCS_SHIFT                   8
#define DDR_CR35_W2RSMCS(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR35_W2RSMCS_SHIFT))&DDR_CR35_W2RSMCS_MASK)
/* CR36 Bit Fields */
#define DDR_CR36_Not_Used_MASK                   0xFFFFu
#define DDR_CR36_Not_Used_SHIFT                  0
#define DDR_CR36_Not_Used(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR36_Not_Used_SHIFT))&DDR_CR36_Not_Used_MASK)
#define DDR_CR36_NOT_USED_MASK                   0xFFFF0000u
#define DDR_CR36_NOT_USED_SHIFT                  16
#define DDR_CR36_NOT_USED(x)                     (((uint32_t)(((uint32_t)(x))<<DDR_CR36_NOT_USED_SHIFT))&DDR_CR36_NOT_USED_MASK)
/* CR37 Bit Fields */
#define DDR_CR37_R2RSAME_MASK                    0x7u
#define DDR_CR37_R2RSAME_SHIFT                   0
#define DDR_CR37_R2RSAME(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR37_R2RSAME_SHIFT))&DDR_CR37_R2RSAME_MASK)
#define DDR_CR37_R2WSAME_MASK                    0x700u
#define DDR_CR37_R2WSAME_SHIFT                   8
#define DDR_CR37_R2WSAME(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR37_R2WSAME_SHIFT))&DDR_CR37_R2WSAME_MASK)
#define DDR_CR37_W2RSAME_MASK                    0x70000u
#define DDR_CR37_W2RSAME_SHIFT                   16
#define DDR_CR37_W2RSAME(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR37_W2RSAME_SHIFT))&DDR_CR37_W2RSAME_MASK)
#define DDR_CR37_W2WSAME_MASK                    0x7000000u
#define DDR_CR37_W2WSAME_SHIFT                   24
#define DDR_CR37_W2WSAME(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR37_W2WSAME_SHIFT))&DDR_CR37_W2WSAME_MASK)
/* CR38 Bit Fields */
#define DDR_CR38_PDNCS_MASK                      0x1Fu
#define DDR_CR38_PDNCS_SHIFT                     0
#define DDR_CR38_PDNCS(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR38_PDNCS_SHIFT))&DDR_CR38_PDNCS_MASK)
#define DDR_CR38_PUPCS_MASK                      0x1F00u
#define DDR_CR38_PUPCS_SHIFT                     8
#define DDR_CR38_PUPCS(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR38_PUPCS_SHIFT))&DDR_CR38_PUPCS_MASK)
#define DDR_CR38_PWRCNT_MASK                     0x7FF0000u
#define DDR_CR38_PWRCNT_SHIFT                    16
#define DDR_CR38_PWRCNT(x)                       (((uint32_t)(((uint32_t)(x))<<DDR_CR38_PWRCNT_SHIFT))&DDR_CR38_PWRCNT_MASK)
/* CR39 Bit Fields */
#define DDR_CR39_P0RDCNT_MASK                    0x7FFu
#define DDR_CR39_P0RDCNT_SHIFT                   0
#define DDR_CR39_P0RDCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DDR_CR39_P0RDCNT_SHIFT))&DDR_CR39_P0RDCNT_MASK)
#define DDR_CR39_RP0_MASK                        0x30000u
#define DDR_CR39_RP0_SHIFT                       16
#define DDR_CR39_RP0(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR39_RP0_SHIFT))&DDR_CR39_RP0_MASK)
#define DDR_CR39_WP0_MASK                        0x3000000u
#define DDR_CR39_WP0_SHIFT                       24
#define DDR_CR39_WP0(x)                          (((uint32_t)(((uint32_t)(x))<<DDR_CR39_WP0_SHIFT))&DDR_CR39_WP0_MASK)
/* CR40 Bit Fields */
#define DDR_CR40_P0TYP_MASK                      0x3u
#define DDR_CR40_P0TYP_SHIFT                     0
#define DDR_CR40_P0TYP(x)                        (((uint32_t)(((uint32_t)(x))<<DDR_CR40_P0TYP_SHIFT))&DDR_CR40_P0TYP_MASK)
#define DDR_CR40_P1WRCNT_MASK                    0x7FF00u
#define DDR_CR40_P1WRCNT_SHIFT                   8
