ARMmbed/DAPLink/shared/cmsis/TARGET_Freescale/include/device/MK70F12/MK70F12.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define PDB0_PO0EN                               PDB0_POEN
#define PMC_REGSC_BGEN_MASK                      0x10u
#define PMC_REGSC_BGEN_SHIFT                     4
#define SIM_SCGC4_IIC2_MASK                      SIM_SCGC4_IIC0_MASK
#define SIM_SCGC4_IIC2_SHIFT                     SIM_SCGC4_IIC0_SHIFT
#define SIM_SCGC6_FTFE_MASK                      0x1u
#define SIM_SCGC6_FTFE_SHIFT                     0
#define SIM_SCGC7_PFLEXNVM_MASK                  0x4u
#define SIM_SCGC7_PFLEXNVM_SHIFT                 2
#define LCDC_LSR_GWLPM_MASK                      0x10000000u
#define LCDC_LSR_GWLPM_SHIFT                     28
#define LCDC_LIER_ERR_RES_EN_MASK                0x4u
#define LCDC_LIER_ERR_RES_EN_SHIFT               2
#define LCDC_LIER_GW_ERR_RES_EN_MASK             0x40u
#define LCDC_LIER_GW_ERR_RES_EN_SHIFT            6
#define LCDC_LISR_ERR_RES_MASK                   0x4u
#define LCDC_LISR_ERR_RES_SHIFT                  2
#define LCDC_LISR_GW_ERR_RES_MASK                0x40u
#define LCDC_LISR_GW_ERR_RES_SHIFT               6

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#else /* #if !defined(MCU_MK70F12) && !defined(MCU_MK70F15) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0200u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0200u) */
#endif  /* #if !defined(MCU_MK70F12) && !defined(MCU_MK70F15) */

/* MK70F12.h, eof. */
